#include <stdio.h>

void bubble(int A[], int n)
{
	/*
	3 4 2 5 1
	1)3,4 비교
	2)4,2 비교
	>3 2 4 5 1
	3)4,5비교
	>3 2 4 5 1
	4)5,1 비교
	>3 2 4 1 5
	======================
	1)3,2비교
	>2 3 4 1 5
	2)3,4비교
	3)4,1비교
	>2 3 1 4 5
	4)4,5비교
	>2 3 1 4 5
	========================
	1)2,3비교
	2)3,1비교
	>2 1 3 4 5
	3)3,4비교
	4)4,5비교
	>2 1 3 4 5
	=======================
	1)2,1비교
	>1 2 3 4 5
	2)2,3비교
	3)3,4비교
	4)4,5 비교	
	*/
	int temp = 0;
	//for (int i=0;i<n;i++)
	//{
	//	for (int j=0;j<n-1;j++)
	//	{
	//		if (A[j]>A[j+1])
	//		{
	//			//이 비교 때문에 j<n-1
	//			//오름차순으로 되어있지 않은 경우만 정렬하면 되잖아욤!
	//			temp = A[j + 1];
	//			A[j + 1] = A[j];
	//			A[j] = temp;

	//		}
	//		
	//	}
	//}
	//어떻게 보면 1회전때 최댓값이 맨 뒤로 보내어지고, 그 뒤에는 앞에 있는 요소들끼리 비교하게 되는 양상!
	// 7 8 3 2 1
	/*1)7,8비교
	  2)8,3비교
	  >7 3 8 2 1
	  3)8,2비교
	  >7 3 2 8 1
	  4)8,1비교
	  >7 3 2 1 8
	  =========
	  1)7,3비교
	  >3 7 2 1 8
	  2)7,2비교
	  >3 2 7 1 8
	  3)7,1비교
	  >3 2 1 7 8
	  ==========
	  1)3,2비교
	  >2 3 1 7 8
	  2)3,1비교
	  >2 1 3 7 8
	  ==========
	  1)2,1비교
	  >1 2 3 7 8
	  
	  >>비교하는 범주가 1씩 줄어들고 있다!(<-방향으로)
	  */
	for (int i=0;i<n-1;i++)
	{
		//맨 마지막에는 0,1도 비교해야하니까 i<n-1!!
		for (int j=0;j<n-1-i;j++)
		{
			//n-1 은 j,j+1요소를 비교하기 위함!
			if (A[j]>A[j+1])
			{
				temp = A[j];
				A[j] = A[j + 1];
				A[j + 1] = temp;
			}
		}
	}
}
int main()
{
	//모두 정렬될 때까지 최솟값을 구하는 것
	int arr[5] = { 3,9,2,10,1 };
	
	int size = sizeof(arr)/sizeof(int); //배열의 크기 만듦!

	bubble(arr,size);

	for (int i=0;i<size;i++)
	{
		printf("arr[%d]: %d\t", i, arr[i]);
	}
	printf("\n");

	return 0;
}
